Dataset/Advanced/counterFlowFlame2D_SA/GT_Files/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
|  \\    /   O peration     | Website:  https://openfoam.org
|   \\  /    A nd           | Version:  10
|    \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;   // Small positive value to initiate turbulence

boundaryField
{
    outlet
    {
        type            zeroGradient;
    }

    air
    {
        type            fixedValue;
        value           uniform 1e-5;   // Small non-zero value at inlet
    }

    fuel
    {
        type            fixedValue;
        value           uniform 1e-5;   // Small non-zero value at inlet
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //

